[
    {
        "title": "Reminder: This Weekend's \"Server Slam\" is going to slam the servers.",
        "ups": 380,
        "selftext": "Just a friendly reminder for everyone that the entire point of this weekend is to stress test and overload the servers.\n\nExpect log-in queues, expect connections issues, expect disconnects, and expect lag.\n\nBefore you come on Reddit, or anywhere else on the internet to complain about Blizzard and \"their trash servers\" or their \"broken game\", take this into consideration.\n\nThis weekend is a welcome and unexpected opportunity for us all to play and enjoy some pre-release playtime once more, as well as earn rewards and preview some of the changes made from the betas. All for free. However, it is also, and primarily, for the developers to test &amp; prepare the servers for release in a few weeks.\n\nBlizzard certainly isn't a company without flaws or controversy, but with all these recent botched and incomplete releases from AAA companies, let's take a moment and appreciate that the Diablo 4 developers are at least putting in real effort to ensure a smooth launch for us all. \n\nSo enjoy this weekend, but remember why we are doing it."
    },
    {
        "title": "Build Calculator Update - Server Slam Datamined Info!",
        "ups": 865,
        "selftext": "https://lothrik.github.io/diablo4-build-calc/\n\nBuild 41193 (the server slam preload) is fully datamined now, if you haven't already seen it.\n\nGo take a look at the updated skill nodes, paragon nodes, aspects, and uniques!\n\nDisclaimer: Skill cooldowns, skill resource costs, and ~~lucky hit chance numbers~~ are **not** datamined. Those values are (for the moment) manually defined, meaning they're slightly out of date. Some examples of things this affects are: Whirlwind's fury cost and Rogue Imbuement cooldowns.\n\nAdditionally Blizzard changed something about how they store flat values for items (Razorplate granting \"#\" thorns, for example) &amp;mdash; I haven't figured out where they moved those values to yet, so they just show a placeholder \"#\" instead.\n\nUpdate: Lucky Hit Chance values now *are* datamined. Cooldowns and resource costs were manually updated. I'll see how feasible it is to get those datamined properly tomorrow."
    }
]